{"input": "What is the tallest species of bamboo?", "output": "Dendrocalamus giganteus, or giant bamboo, can reach heights of 30 meters, making it the tallest bamboo species."}
{"input": "What pigment causes autumn leaf color in maples?", "output": "Anthocyanins produce the red and purple hues in maple leaves during autumn, synthesized as chlorophyll degrades."}
{"input": "What is the fastest-growing plant ever recorded?", "output": "Certain species of bamboo hold the record, with measured growth rates of 91 cm in a single 24-hour period."}
{"input": "How does the corpse flower attract pollinators?", "output": "Amorphophallus titanum emits dimethyl trisulfide and trimethylamine, mimicking decomposing flesh to attract carrion beetles."}
{"input": "What is mycorrhizal networking in forests?", "output": "Mycorrhizal networks are fungal hyphal connections between tree roots that facilitate carbon, water, and nutrient exchange across a forest stand."}
{"input": "What adaptation allows mangroves to tolerate salt water?", "output": "Mangroves use salt-excreting glands in their leaves and ultrafiltration at root membranes to exclude up to 97% of sodium chloride."}
{"input": "What is the oldest known living individual tree?", "output": "A Great Basin bristlecone pine named Methuselah, in the White Mountains of California, is over 4,850 years old."}
{"input": "How do Venus flytraps count stimuli?", "output": "Venus flytraps require two trigger-hair deflections within 20 seconds to close, using action potentials and calcium ion accumulation as a counting mechanism."}
{"input": "What is the cruising altitude of a Boeing 787 Dreamliner?", "output": "The Boeing 787 Dreamliner typically cruises at 43,000 feet (13,100 meters), higher than most commercial aircraft."}
{"input": "What material is the leading edge of the A350 wing made from?", "output": "The Airbus A350 XWB uses thermoplastic carbon-fiber-reinforced polymer for its wing leading edges, reducing weight by 20% over aluminum."}
{"input": "What is the maximum range of the Airbus A350-900ULR?", "output": "The A350-900ULR has a maximum range of 9,700 nautical miles (17,964 km), enabling nonstop Singapore-to-New-York service."}
{"input": "How does a turbofan engine's bypass ratio affect fuel efficiency?", "output": "Higher bypass ratios (10:1 or above in modern engines like the GE9X) improve fuel efficiency by generating more thrust from slower-moving air, reducing specific fuel consumption."}
{"input": "What is the function of winglets on modern airliners?", "output": "Winglets reduce induced drag by disrupting wingtip vortices, typically improving fuel efficiency by 3-5% on long-haul routes."}
{"input": "What is ETOPS certification?", "output": "ETOPS (Extended-range Twin-engine Operations) certifies how far a twin-engine aircraft can fly from a diversion airport, with ETOPS-370 allowing up to 370 minutes."}
{"input": "What is the purpose of bleed air in aircraft systems?", "output": "Bleed air, extracted from engine compressor stages, pressurizes the cabin, provides anti-icing for wings and engine inlets, and drives pneumatic actuators."}
{"input": "What is the difference between ILS CAT IIIb and CAT IIIc approaches?", "output": "CAT IIIb allows landing with visibility down to 50 feet decision height and 75 meters RVR, while CAT IIIc permits zero-visibility autoland with no RVR minimum."}
