{"input": "What is the Maillard reaction?", "output": "The Maillard reaction is a non-enzymatic browning process between amino acids and reducing sugars at 140-165 degrees Celsius, producing hundreds of flavor compounds."}
{"input": "Why does pasta water need to be heavily salted?", "output": "Pasta absorbs water during cooking; salting at 1-2% by weight seasons the noodle internally, which surface seasoning alone cannot achieve after draining."}
{"input": "What is the role of gluten in bread dough?", "output": "Gluten forms an elastic protein network that traps CO2 from yeast fermentation, giving bread its open crumb structure and chewy texture."}
{"input": "What temperature does sugar reach at hard-crack stage?", "output": "Sugar reaches hard-crack stage at 149-154 degrees Celsius (300-310 degrees Fahrenheit), producing brittle, glassy candy when cooled."}
{"input": "Why is fond important in French cooking?", "output": "Fond is the layer of caramelized proteins and sugars stuck to the pan after searing; deglazing it recovers concentrated flavor for sauces."}
{"input": "What is the difference between confit and deep frying?", "output": "Confit cooks food submerged in fat at 85-95 degrees Celsius for hours, while deep frying uses 175-190 degrees Celsius for minutes. Confit tenderizes; frying crisps."}
{"input": "How does an immersion circulator maintain temperature?", "output": "An immersion circulator uses a PID controller, heating element, and pump to maintain water temperature within 0.1 degrees Celsius for sous vide cooking."}
{"input": "What makes high-extraction flour different from white flour?", "output": "High-extraction flour retains 85-90% of the wheat kernel including bran particles and germ, yielding more flavor and minerals than 72-extraction white flour."}
{"input": "What is the Chandrasekhar limit?", "output": "The Chandrasekhar limit is 1.4 solar masses, the maximum mass a white dwarf can sustain before electron degeneracy pressure fails and it collapses into a neutron star."}
{"input": "What causes a Type Ia supernova?", "output": "A Type Ia supernova occurs when a white dwarf in a binary system accretes matter past the Chandrasekhar limit, triggering runaway carbon fusion."}
{"input": "What is the cosmic microwave background?", "output": "The CMB is relic radiation from 380,000 years after the Big Bang, when the universe cooled enough for hydrogen to form and photons to decouple from matter, observed today at 2.725 K."}
{"input": "How do astronomers measure distances using standard candles?", "output": "Type Ia supernovae have a known peak luminosity; comparing apparent brightness to absolute brightness gives the distance via the distance modulus formula."}
{"input": "What is the Hubble tension?", "output": "The Hubble tension is a 4-6 sigma discrepancy between the expansion rate measured from the CMB (67.4 km/s/Mpc) and from local distance ladders (73.0 km/s/Mpc)."}
{"input": "What is a magnetar?", "output": "A magnetar is a neutron star with a magnetic field of 10^14 to 10^15 gauss, roughly a quadrillion times Earth's field, powered by magnetic field decay rather than rotation."}
{"input": "What is the significance of the James Webb Space Telescope's L2 orbit?", "output": "JWST orbits the Sun-Earth L2 Lagrange point, 1.5 million km from Earth, where its sunshield can simultaneously block light from the Sun, Earth, and Moon for deep infrared observations."}
{"input": "What is gravitational lensing?", "output": "Gravitational lensing occurs when a massive foreground object bends spacetime, curving the light path from a background source, magnifying and distorting its image per general relativity."}
